7767517
35 36
Input            input.1                  0 1 input.1
MemoryData       217                      0 1 217 0=1
Convolution      Conv_0                   1 1 input.1 168 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576
ReLU             Relu_1                   1 1 168 87
Convolution      Conv_2                   1 1 87 171 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_3                   1 1 171 90
Pooling          MaxPool_4                1 1 90 91 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_5                   1 1 91 174 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_6                   1 1 174 94
Convolution      Conv_7                   1 1 94 177 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_8                   1 1 177 97
Pooling          MaxPool_9                1 1 97 98 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_10                  1 1 98 180 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             Relu_11                  1 1 180 101
Convolution      Conv_12                  1 1 101 183 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_13                  1 1 183 104
Pooling          MaxPool_14               1 1 104 105 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_15                  1 1 105 186 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_16                  1 1 186 108
Convolution      Conv_17                  1 1 108 189 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_18                  1 1 189 111
Split            splitncnn_0              1 2 111 111_splitncnn_0 111_splitncnn_1
Convolution      Conv_19                  1 1 111_splitncnn_1 192 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             Relu_20                  1 1 192 114
Convolution      Conv_21                  1 1 114 195 0=65 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16640
Permute          Transpose_22             1 1 195 117 0=5
Softmax          Softmax_23               1 1 117 118 0=2 1=1
Permute          Transpose_24             1 1 118 119 0=5
Crop             Slice_29                 1 1 119 124 -23309=1,0 -23310=1,-1 -23311=1,0
PixelShuffle     Reshape_32               1 1 124 output.1 0=8
Convolution      Conv_33                  1 1 111_splitncnn_0 198 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             Relu_34                  1 1 198 152
Convolution      Conv_35                  1 1 152 201 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Interp           Resize_37                1 1 201 159 0=2 1=8.000000e+00 2=8.000000e+00 3=0 4=0 6=0
Normalize        Div_42                   1 1 159 output.2 1=1 2=1.000000e-12 3=1 9=1
